import type { Dictionary } from '../types'

/** 内置默认字典（与 balabala.xlsx / 参考洗唛图一致），Excel 加载后会覆盖 */
export const defaultDictionary: Dictionary = {
  languages: ['英文', '俄文', '阿语译文'],
  entries: {
    成分: {
      英文: 'Composition',
      英语: 'Composition:',
      俄文: 'Состав',
      俄语: 'Состав:',
      印尼语: 'Komposisi:',
      阿语译文: 'المكونات',
    },
    成份: {
      英文: 'Composition',
      英语: 'Composition:',
      俄文: 'Состав',
      俄语: 'Состав:',
      印尼语: 'Komposisi:',
      阿语译文: 'المكونات',
    },
    洗涤说明: {
      英文: 'Washing instructions',
      英语: 'Washing instructions:',
      俄文: 'Инструкции по уходу',
      俄语: 'Инструкции по уходу:',
      印尼语: 'Petunjuk pencucian:',
      阿语译文: 'تعليمات الغسيل',
    },
    温馨提示: {
      英文: 'Warm tips',
      英语: 'Warm tips:',
      俄文: 'Полезные советы',
      俄语: 'Полезные советы:',
      印尼语: 'Tips:',
      阿语译文: 'نصائح',
    },
    面料: {
      英文: 'Fabric',
      俄文: 'материал',
      阿语译文: 'النسيج',
    },
    罗纹: {
      英文: 'Ribbing',
      俄文: 'рисунок тюля',
      阿语译文: 'قماش مضلع',
    },
    里料: {
      英文: 'Lining',
      俄文: 'материал подкладки',
      阿语译文: 'البطانة',
    },
    中国制造: {
      英文: 'Made in China',
      英语: 'Made in China',
      俄文: 'Сделано в Китае',
      俄语: 'Сделано в Китае',
      印尼语: 'Buatan China',
      阿语译文: 'صنع في الصين',
    },
    '本商品建议单独洗涤，如有轻微褪色属正常现象，为保持衣服色泽，衣服不宜久浸。': {
      英文:
        'Tips: Wash separately.Slight color fading is normal.To keep product color,do not soak for a long time.',
      俄文:
        'Рекомендуется стирать отдельно или с вещами такой же окраски. Не рекомендуется длительное замачивание.',
      阿语译文:
        'نوصي بغسل هذا المنتج بشكل منفصل، وتغير اللون بشكل طفيف هو أمر طبيعي. ومن أجل الحفاظ على لون الملابس، ينبغي عدم نقع الملابس لمدة طويلة.',
    },
    '本商品建议单独洗涤，如有轻微褪色属正常现象，为保持衣服色泽，衣服不宜久浸': {
      英文:
        'Tips: Wash separately.Slight color fading is normal.To keep product color,do not soak for a long time.',
      俄文:
        'Рекомендуется стирать отдельно или с вещами такой же окраски. Не рекомендуется длительное замачивание.',
      阿语译文:
        'نوصي بغسل هذا المنتج بشكل منفصل، وتغير اللون بشكل طفيف هو أمر طبيعي. ومن أجل الحفاظ على لون الملابس، ينبغي عدم نقع الملابس لمدة طويلة.',
    },
    腈纶: {
      英文: 'Acrylic',
      俄文: 'нитрон',
      阿语译文: 'البولي أكريلونيتريل',
    },
    绵羊毛: {
      英文: 'Sheep wool',
      俄文: 'овечья шерсть',
      阿语译文: 'صوف الأغنام',
    },
    锦纶: {
      英文: 'Nylon',
      俄文: 'нейлон',
      阿语译文: 'النايلون',
    },
    氨纶: {
      英文: 'Spandex',
      俄文: 'спандекс',
      阿语译文: 'سبانديكس',
    },
    棉: {
      英文: 'Cotton',
      俄文: 'хлопок',
      阿语译文: 'القطن',
    },
  },
}
